// 企业发放的奖金根据利润提成。利润低于或等于100000元的，奖金可提10%;
// 利润高于100000元，低于200000元（100000<I≤200000）时，低于100000元的部分按10％提成，高于100000元的部分，可提成 7.5%;
// 200000<I≤400000时，低于200000元部分仍按上述办法提成，（下同），高于200000元的部分按5％提成；
// 400000<I≤600000元时，高于400000元的部分按3％提成；

// 600000<I≤1000000时，高于600000元的部分按1.5%提成；
// I>1000000时，超过1000000元的部分按1%提成。从键盘输入当月利润I,求应发奖金总数。
#include<stdio.h>
int main()
{
    int wages, bounds, a;
    scanf("%d",&wages);
    if(wages<=100000)
    {
        bounds = wages * 0.1;
    printf("%d",bounds);
    }
    else if(100000<a&&a<=200000)
    {
        a = wages - 100000;
        bounds = 100000 * 0.1 + a * 0.075;
     printf("%d",bounds);
     }
    else if(200000<wages&&wages<=400000)
    {
        a = wages - 200000;
        bounds = a * 0.05 + 100000 * 0.1 + 100000 *0.075;
     printf("%d",bounds);
    }
    else if(400000<wages&&wages<=600000)
    {
        a = wages - 400000;
        bounds = a * 0.03 + 100000 * 0.1 + 100000 *0.075 + 200000 * 0.05;
     printf("%d",bounds);
    }
    else if(600000<wages&&wages<=1000000)
    {
        a = wages - 600000;
        bounds = a * 0.015 + 400000 * 0.03 + 100000 * 0.1 + 100000 *0.075 + 200000 * 0.05;
     printf("%d",bounds);
    }
     else if(wages>1000000)
     {
        a = wages - 1000000;
        bounds = a * 0.01 + 400000 * 0.03 + 100000 * 0.1 + 100000 *0.075 + 200000 * 0.05;
    printf("%d",bounds);
     }
    
    return 0;
}