//刘均宝 计科五班 2022122100848

//问题1. 500以内的最大素数。编程计算n(n<=500)以内的10个最大素数及其和，分别输出这最大的10个素数及其和。n的值要求从键盘输入。要求10个素数按从大到小的顺序输出。（总分占比50%）


//设计思路
//首先scanf接受n的数，再循环中，让n从大到校递减，并且求得10个素数后停止循环，即可求出最大的是个素数。再使用一个for循环求出素数。当一个数不是素数时，让flag=0。再用if进行判断，当flag不等于0时，输出该数。
//源代码
#include<stdio.h>
#include<math.h>
int main()
{
    int n, x, count = 0, sum = 0, flag;
    printf("input n(n<=500)");
    scanf("%d", &n);
    for (x = n, count = 0; count < 10 && x>1; x--)  //输入的数，从大到小递减，找出是个素数后停止
    {
        for (int i = 2; i <= sqrt(x); i++)    //把输入的数，求素数。
        {
            flag = 1;
            if (x % i == 0)
                flag = 0;
            break;
        }
        if (flag != 0)
        {
            printf("%d ", x);
            count++;//记录素数数量
            sum = sum + x;
        }
    }
    printf("\nsum=%d", sum);
    return 0;
}
//运行结果
//input n(n<=500)444
//443 441 439 437 435 433 431 429 427 425
//sum=4340



//问题2.好数对。已知一个集合A，对A中任意两个不同的元素求和，若求得的和仍在A内，则称其为好数对。例如，集合A={1 2 3 4}，1+2=3，1+3=4，则1,2和1,3 是两个好数对。编写程序求给定集合中好数对的个数。
//设计思路
//首先利用栓从循环，求出数组中每个元素相加的数，并存入一个新的数组。再利用乡村换，求出新数组中的每个元素和先前数组中有无相同的元素，进行对比

//源代码
#include<stdio.h>
#include<math.h>
int main()
{
    int n, x, h;
    printf("输入集合A的元素个数");
    scanf("%d", &n);
    int arr1[1000], arr2[500], count = 0, o = 0;  //数组的数值设置为定值！！！！
    printf("输入A的各个元素，用空格隔开");
    for (int i = 0; i < n; i++)
    {
        scanf("%d", &x);
        arr1[i] = x;
    }
    //数组中的每个元素进行训话相加
    for (int k = 0; k < n - 1; k++)
    {
        for (int m = k + 1; m < n; m++)
        {
            arr2[o] = arr1[k] + arr1[m];
            o++;
        }
    }
    //让相加的结果和数组中的每个元素进行比对
    for (int m = 0; m < o; m++) {  //数组具体循环的个数必须如实填写！！！！！！！！
        for (int j = 0; j < n; j++) {
            if (arr1[j] == arr2[m])
                count++;
        }
    }
    printf("%d", count);
    return 0;
}

//执行结果
//输入集合A的元素个数11
//输入A的各个元素，用空格隔开3232 232323 2322 131 324 442 24242 11 21 10 31
//2
